Все задачи должны быть решены без использования списков (массивов) и аналогичных структур. 
Задания выполняются в одном файле, должен быть реализован механизм выбора задания (и подзадания, если оно предусмотрено): пользователь вводит число, соответвующее номеру задания, затем с новой строки
 вводятся данные, соответствующие условию.

1. Дано число n. С начала суток прошло n минут. Определите, сколько часов и минут будут показывать электронные часы в этот момент. Программа должна вывести два числа: количество часов (от 0 до 23)
 и количество минут (от 0 до 59).

2. Даны две различные клетки шахматной доски, определите, может ли щахматная фигура попасть с первой клетки на вторую одним ходом. Программа получает на вход четыре числа от 1 до 8 каждое, 
задающие номер столбца и номер строки сначала для первой клетки, потом для второй клетки. Программа должна вывести YES, если из первой клетки ходом ладьи можно попасть во вторую или NO в 
противном случае.
Фигуры:
1) ладья;
2) король;
3) слон;
4) ферзь;
5) конь.

3. Улитка ползет по вертикальному шесту высотой h метров, поднимаясь за день на a метров, а за ночь спускаясь на b метров. На какой день улитка доползет до вершины шеста?
Программа получает на вход натуральные числа h, a, b.
Программа должна вывести одно натуральное число. Гарантируется, что a > b.

4. 
1) С начала суток прошло H часов, M минут, S секунд (0 <= H < 12, 0 <= M < 60, 0 <= S < 60). По данным числам H, M, S определите угол (в градусах), на который повернулаcь часовая стрелка 
с начала суток и выведите его в виде действительного числа с тремя знаками после запятой.
2) С начала суток часовая стрелка повернулась на угол в alpha градусов. Определите на какой угол повернулась минутная стрелка с начала последнего часа. Входные и выходные данные — 
действительные числа.
3) С начала суток часовая стрелка повернулась на угол в alpha градусов. Определите сколько полных часов, минут и секунд прошло с начала суток.

5. По данному натуральном n вычислите сумму 1!+2!+3!+...+n!. В решении этой задачи можно использовать только один цикл. Пользоваться математической библиотекой math в этой задаче запрещено.

6. По данному натуральному n <= 9 выведите лесенку из n ступенек, i-я ступенька состоит из чисел от 1 до i без пробелов.

7. Для настольной игры используются карточки с номерами от 1 до N. Одна карточка потерялась. Найдите ее, зная номера оставшихся карточек. Дано число N, далее N - 1 
номер оставшихся карточек (различные числа от 1 до N). Программа должна вывести номер потерянной карточки.

print("Потерянная карточка")
n=int(input("Введите кол-во карточек: "))
summaCards=0 # сложим все карточки
summa_range_i=0 # сумма всех чисел 
for i in range(1,n+1):    
summa_range_i+=i # cумма всех N карточек, карточки не повторяются от 1 до N   
for i in range(1,n):    
a=int(input("Введите номиналы карточек: "))    
summaCards+=a # сумма всех карточек, кроме одной, карточки не повторяются 1 не хватает   # summa_range_i-summaCards - разность сумм, узнаем какой карточки нет   
print("Потерянная карточка - {}".format(summa_range_i-summaCards))